name: "resnet"
platform: "ensemble"

input [
  {
    name: "INPUT"
    data_type: TYPE_FP32
    dims: [-1, -1, -1, -1]
  }
]

output [
  {
    name: "OUTPUT"
    data_type: TYPE_STRING
    dims: [ -1, 1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "inference"
      model_version: 2
      input_map {
        key: "pixel_values"
        value: "INPUT"
      }
      output_map {
        key: "logits"
        value: "logits"
      }
    },
    {
      model_name: "postprocess"
      model_version: 1
      input_map {
        key: "logits"
        value: "logits"
      }
      output_map {
        key: "OUTPUT"
        value: "OUTPUT"
      }
    }
  ]
}
