name: "postprocess"
backend: "python"
max_batch_size: 64

parameters: {
  key: "EXECUTION_ENV_PATH",
  value: {string_value: "/app/conda-pack.tar.gz"}
}

input [
  {
    name: "logits",
    data_type: TYPE_FP32,
    dims: [ 1000 ]
  }
],
output [
  {
    name: "OUTPUT"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

instance_group {
    count: 1
    kind: KIND_CPU
}
